Catalogs/КлассификаторыМинЗдрава.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторыМинЗдрава</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассификаторовМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Атрибуты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиОбновленияСправочниковЕГИСЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбновленияСправочниковЕГИСЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОбновления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыАвтоОбновленияСправочниковЕГИСЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Классификатор</Name>
					<Comment>OID классификатора</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РежимыАвтоОбновленияСправочниковЕГИСЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимыАвтоОбновленияСправочниковЕГИСЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выключено</Name>
					<Comment>Автообновление выключено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полное</Name>
					<Comment>Полностью автоматическое обновление</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоЗагруженных</Name>
					<Comment>Автоматически обновлять только загруженные ранее</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КлассификаторыМинЗдрава/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем ИсходноеОтображение;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПроизвольныйЗапрос") Тогда
		Список.ПроизвольныйЗапрос = Истина;
		Список.ТекстЗапроса = Параметры.ПроизвольныйЗапрос;
	КонецЕсли;
	
	Элементы.ФормаЗагрузитьСправочник.Видимость = ЕстьПравоЗагрузкиКлассификаторов();
	
	Если Параметры.Свойство("Отбор") Тогда
		НастроитьСписокПоОтбору(Параметры.Отбор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список, Ложь);
	
	ТекущиеВидыКлассификатора = ТекущийОтборВидовКлассификатора(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор);
	УстановитьОтображениеКолонокПоВидуКлассификатора(ТекущиеВидыКлассификатора);
	
	Если ТекущиеВидыКлассификатора.Количество() = 1 Тогда
		ЭтотОбъект.Заголовок = Строка(ТекущиеВидыКлассификатора[0]);
	КонецЕсли;
	
	Если УстановитьОтображениеСписком Тогда
		ИсходноеОтображение = Элементы.Список.Отображение;
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ИсходноеОтображение) Тогда
		Элементы.Список.Отображение = ИсходноеОтображение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоместитьВАрхив(Команда)
	
	РаботаСДиалогамиКлиент.ПоместитьВАрхив(Элементы.Список.ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьАрхивные(Команда)
	
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ТекущиеВидыКлассификатора = ТекущийОтборВидовКлассификатора(Настройки.Отбор);
	
	Если ЗначениеЗаполнено(ТекущиеВидыКлассификатора) Тогда
		Для Каждого СтрокаСписка Из Строки Цикл
			Если ТекущиеВидыКлассификатора.НайтиПоЗначению(СтрокаСписка.Значение.Данные.ВидКлассификатора) = Неопределено Тогда
				Для Каждого ОформлениеЯчейки Из СтрокаСписка.Значение.Оформление Цикл
					ОформлениеЯчейки.Значение.УстановитьЗначениеПараметра("Видимость", Ложь);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекущийОтборВидовКлассификатора(Знач КомпоновщикНастроек)
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ОтборКомпоновкиСписка = КомпоновщикНастроек.ПолучитьНастройки().Отбор.Элементы;
	Иначе
		ОтборКомпоновкиСписка = КомпоновщикНастроек.Элементы;
	КонецЕсли;
	
	ВидыКлассификатора = Новый СписокЗначений;
	Для Каждого ЭлементОтбора Из ОтборКомпоновкиСписка Цикл
		Если Не (ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
				И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКлассификатора")
				И ЭлементОтбора.Использование)
		Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			И ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение)
		Тогда
			ВидыКлассификатора.Добавить(ЭлементОтбора.ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			Для Каждого ВидКлассификатораОтбора Из ЭлементОтбора.ПравоеЗначение Цикл
				Если ЗначениеЗаполнено(ВидКлассификатораОтбора.Значение) Тогда
					ВидыКлассификатора.Добавить(ВидКлассификатораОтбора.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВидыКлассификатора;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтображениеКолонокПоВидуКлассификатора(ТекущиеВидыКлассификатора)
	
	ОтображаемыеКолонки = ОбщегоНазначенияБИТКлиентСервер.НовыйМассив("УИДЕГИСЗ", "НПП", "Атрибуты");
	
	Для Каждого ВидКлассификатора Из ТекущиеВидыКлассификатора Цикл
		Если ВидКлассификаторовСПолнымНаименованием(ВидКлассификатора.Значение) Тогда
			ОтображаемыеКолонки.Добавить("НаименованиеПолное");
		Иначе
			ОтображаемыеКолонки.Добавить("Наименование");
		КонецЕсли;
	КонецЦикла;
	
	Если ТекущиеВидыКлассификатора.Количество() = 0 Тогда
		ОтображаемыеКолонки.Добавить("Наименование");
		ОтображаемыеКолонки.Добавить("ВидКлассификатора");
	ИначеЕсли ТекущиеВидыКлассификатора.Количество() > 1 Тогда
		ОтображаемыеКолонки.Добавить("ВидКлассификатора");
	КонецЕсли;
	
	Для Каждого КолонкаСписка Из Элементы.Список.ПодчиненныеЭлементы Цикл
		КолонкаСписка.Видимость = ОтображаемыеКолонки.Найти(КолонкаСписка.Имя) <> Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСправочника(ТекущийВидКлассификатора)
	
	МенеджерСправочника = Справочники["КлассификаторыМинЗдрава"];
	OID = МенеджерСправочника.ПолучитьOIDСправочника(ТекущийВидКлассификатора);
	
	МенеджерЗаписи = РегистрыСведений.НастройкиОбновленияСправочниковЕГИСЗ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Классификатор = OID;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.РежимОбновления = Перечисления.РежимыАвтоОбновленияСправочниковЕГИСЗ.Полное Тогда
		РежимОбновленияПолное = Истина;
	Иначе
		РежимОбновленияПолное = Ложь;
	КонецЕсли;
	
	ДанныеСправочника = Новый Структура;
	ДанныеСправочника.Вставить("OID", OID);
	ДанныеСправочника.Вставить("РежимОбновленияПолное", РежимОбновленияПолное);
	
	Возврат ДанныеСправочника;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьПравоЗагрузкиКлассификаторов()
	
	Если РольДоступна("ДополнительныеПраваЕГИСЗ")
		Или РольДоступна("ПолныеПрава")
		Или ПривилегированныйРежим()
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьСправочник(Команда)
	
	ТекущиеВидыКлассификатора = ТекущийОтборВидовКлассификатора(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор);
	
	Если ТекущиеВидыКлассификатора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеВидыКлассификатора.Количество() > 1 Тогда
		ТекущиеВидыКлассификатора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораВидаКлассификатора", ЭтотОбъект));
		//ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ПослеВыбораВидаКлассификатора", ЭтотОбъект), ТекущиеВидыКлассификатора);
	Иначе
		ЗагрузитьКлассификаторПоВидуКлассификатора(ТекущиеВидыКлассификатора[0].Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВидаКлассификатора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ЗагрузитьКлассификаторПоВидуКлассификатора(ВыбранныйЭлемент.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКлассификаторПоВидуКлассификатора(ВидКлассификатора)
	
	ДанныеСправочника = ПолучитьДанныеСправочника(ВидКлассификатора);
	
	Если ДанныеСправочника.РежимОбновленияПолное Тогда
		ИнтеграцияЕГИСЗВызовСервера.ОбновитьСправочник(ДанныеСправочника.OID);
		Элементы.Список.Обновить();
	Иначе
		СтруктураПараметры = Новый Структура("НаименованиеСправочника, ВидКлассификатора", "КлассификаторыМинЗдрава", ВидКлассификатора);
		ОткрытьФорму("ОбщаяФорма.ЗагрузкаНСИЕГИСЗ", СтруктураПараметры, ЭтотОбъект, ВидКлассификатора,,, Новый ОписаниеОповещения("ЗагрузкаКлассификатораЗавершена",ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаКлассификатораЗавершена(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список, Элементы.СписокСкрытьПоказатьАрхивные.Пометка);
	
КонецПроцедуры

Процедура ДобавитьКолонкиАтрибутов(КолонкиАтрибутов, ВидКлассификатора)
	
	ШаблонТекстаЗапроса = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КлассификаторыМинЗдрава.Ссылка КАК Ссылка,
		|			&Атрибуты
		|		ИЗ
		|			Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					КлассификаторыМинЗдраваАтрибуты.Ссылка КАК Ссылка,
		|					КлассификаторыМинЗдраваАтрибуты.Ключ КАК Ключ,
		|					КлассификаторыМинЗдраваАтрибуты.Значение КАК Значение
		|				ИЗ
		|					Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыМинЗдрава.Атрибуты КАК КлассификаторыМинЗдраваАтрибуты
		|						ПО КлассификаторыМинЗдрава.Ссылка = КлассификаторыМинЗдраваАтрибуты.Ссылка
		|							И (КлассификаторыМинЗдрава.ВидКлассификатора = &ВидКлассификатора)
		|							И (КлассификаторыМинЗдраваАтрибуты.Ключ В (&КлючиАтрибутов))) КАК КлассификаторыМинЗдраваАтрибуты
		|				ПО (КлассификаторыМинЗдраваАтрибуты.Ссылка = КлассификаторыМинЗдрава.Ссылка)
		|		ГДЕ
		|			КлассификаторыМинЗдрава.ВидКлассификатора = &ВидКлассификатора
		|		
		|		СГРУППИРОВАТЬ ПО
		|			КлассификаторыМинЗдрава.Ссылка) КАК КлассификаторСАтрибутами
		|		ПО (КлассификаторСАтрибутами.Ссылка = КлассификаторыМинЗдрава.Ссылка)";
	
	КлючиАтрибутов = Новый Массив;
	ТекстыПолейАтрибутов = Новый Массив;
	ПутиКДанным = Новый Массив;
	НомерКолонкиАтрибута = 1;
	Для Каждого КолонкаАтрибута Из КолонкиАтрибутов Цикл
		КлючиАтрибутов.Добавить(КолонкаАтрибута.Ключ);
		
		ШаблонТекстаПоля =
			"МАКСИМУМ(ВЫБОР
			|		КОГДА КлассификаторыМинЗдраваАтрибуты.Ключ = ""%1""
			|			ТОГДА ВЫРАЗИТЬ(КлассификаторыМинЗдраваАтрибуты.Значение КАК СТРОКА(100))
			|		ИНАЧЕ NULL
			|	КОНЕЦ) КАК %2";
		
		ИмяПоля = СтрШаблон("Атрибут%1", Строка(НомерКолонкиАтрибута));
		ТекстыПолейАтрибутов.Добавить(СтрШаблон(ШаблонТекстаПоля, КолонкаАтрибута.Ключ, ИмяПоля));
		
		ЭлементКолонки = Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Элементы.Атрибуты);
		ЭлементКолонки.Заголовок = КолонкаАтрибута.Заголовок;
		ПутиКДанным.Добавить(Новый Структура("Элемент, ПутьКДанным", ЭлементКолонки, СтрШаблон("Список.%1", ИмяПоля)));
		
		НомерКолонкиАтрибута = НомерКолонкиАтрибута + 1;
	КонецЦикла;
	
	Список.ПроизвольныйЗапрос = Истина;
	Список.ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса, "&Атрибуты", СтрСоединить(ТекстыПолейАтрибутов, "," + Символы.ПС));
	
	Для Каждого ПутьКДаннымЭлемента Из ПутиКДанным Цикл
		ПутьКДаннымЭлемента.Элемент.ПутьКДанным = ПутьКДаннымЭлемента.ПутьКДанным;
	КонецЦикла;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВидКлассификатора", ВидКлассификатора);
	Список.Параметры.УстановитьЗначениеПараметра("КлючиАтрибутов", КлючиАтрибутов);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокПоОтбору(Отбор)
	
	Если (Отбор.Свойство("Ссылка")
		Или Отбор.Свойство("УИДЕГИСЗ")
			И ТипЗнч(Отбор.УИДЕГИСЗ) = Тип("Массив")
			И Отбор.УИДЕГИСЗ.Количество() <= 15)
	Тогда
		УстановитьОтображениеСписком = Истина;
	КонецЕсли;
	
	Если Отбор.Свойство("ВидКлассификатора")
		И Не Список.ПроизвольныйЗапрос
	Тогда
		КолонкиАтрибутов = КолонкиАтрибутовПоВидуКлассификатора(Отбор.ВидКлассификатора);
		Если КолонкиАтрибутов.Количество() > 0 Тогда
			ДобавитьКолонкиАтрибутов(КолонкиАтрибутов, Отбор.ВидКлассификатора);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КолонкиАтрибутовПоВидуКлассификатора(ВидКлассификатора)
	
	КолонкиАтрибутов = Новый Массив;
	
	Если ВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ИммунобиологическиеЛекарственныеПрепараты Тогда
		ДобавитьСтруктуруКолонкиАтрибута(КолонкиАтрибутов, "GROUPMIBP",	"Группа МИПБ");
		ДобавитьСтруктуруКолонкиАтрибута(КолонкиАтрибутов, "DOZA",		"Дозировка МИБП");
		ДобавитьСтруктуруКолонкиАтрибута(КолонкиАтрибутов, "NUM_DOSA",	"Количество доз");
		ДобавитьСтруктуруКолонкиАтрибута(КолонкиАтрибутов, "DRUGFORM",	"Лекарственная форма МИБП");
		ДобавитьСтруктуруКолонкиАтрибута(КолонкиАтрибутов, "DRUGPACK",	"Упаковка 1 уровня (первичная упаковка) МИБП");
		ДобавитьСтруктуруКолонкиАтрибута(КолонкиАтрибутов, "MASS",		"Масса/объем МИБП");
	КонецЕсли;
	
	Возврат КолонкиАтрибутов;
	
КонецФункции

&НаСервере
Процедура ДобавитьСтруктуруКолонкиАтрибута(КолонкиАтрибутов, Ключ, Заголовок)
	
	КолонкиАтрибутов.Добавить(Новый Структура("Ключ, Заголовок", Ключ, Заголовок));
	
КонецПроцедуры

&НаКлиенте
Функция ВидКлассификаторовСПолнымНаименованием(ВидКлассификатора)
	
	ВидыКлассификаторов = Новый Массив;
	ВидыКлассификаторов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.КлассификаторКатегорийЛьгот"));
	ВидыКлассификаторов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.КлассификаторДокументовУдостоверяющихЛичность"));
	ВидыКлассификаторов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.КлассификаторСоциальныхСтатусов"));
	ВидыКлассификаторов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ИммунобиологическиеЛекарственныеПрепараты"));
	ВидыКлассификаторов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ГруппыКровиДляУчетаСигнальнойИнформацииОПациенте"));
	
	Возврат ВидыКлассификаторов.Найти(ВидКлассификатора) <> Неопределено;
	
КонецФункции

#КонецОбласти
